FacturacionDiverza.log

2013-11-02T12:14:58-06:00	SOAP request:	<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.buzonfiscal.com/ns/xsd/bf/bfcorp/3"><soapenv:Body><ns:RequestCancelaCFDi rfcEmisor="AAA010101AAA" rfcReceptor="DIA031002LZ2" uuid="d5b69e4a-62e8-4ec8-aaa3-61cde4493313"/></soapenv:Body></soapenv:Envelope>


2013-11-02T12:14:59-06:00	SOAP response:	<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:ResponseCancelaCFDi xmlns="http://www.buzonfiscal.com/ns/xsd/bf/remision/5" xmlns:ns2="http://www.buzonfiscal.com/ns/bf/conector/1" xmlns:ns3="http://www.buzonfiscal.com/ns/xsd/bf/bfcorp/3" xmlns:ns4="http://www.sat.gob.mx/cfd/3" xmlns:ns5="http://www.buzonfiscal.com/ns/addenda/bf/2" xmlns:ns6="http://www.sat.gob.mx/detallista" xmlns:ns7="http://www.sat.gob.mx/terceros" xmlns:ns8="http://www.sat.gob.mx/ecc" xmlns:ns9="http://www.sat.gob.mx/cfd/2" xmlns:ns10="http://www.sat.gob.mx/ecb" xmlns:ns11="http://www.sat.gob.mx/implocal" xmlns:ns12="http://www.sat.gob.mx/divisas" xmlns:ns13="http://www.sat.gob.mx/donat" xmlns:ns14="http://www.buzonfiscal.com/ns/referenceID/v1" fecha="2013-11-02T12:14:59.358-06:00" canceled="false"><ns2:Result version="1"><ns2:Message message="No encontro el CFD a cancelar." code="18"/></ns2:Result></ns3:ResponseCancelaCFDi></S:Body></S:Envelope>

